from ext import app, db
from models import Product
from models import User
from models import Thing, New, Tour,Info, Doc, Bak

baks=[{"name":"ბაკურიანი",
      "text": "20 დეკემბრიდან დაგეგმეთ ერთდღიანი ზამთრის სალაშქრო ტური -- ბაკურიანი - ანდეზიტი - თორი - ციხისჯვარი საუკეთესო პერიოდი: ზამთარი, იანვარი, თებერვალი, მარტი, დეკემბერი ციხისჯვარის თოვლის-ფეხსაცმლის ტურზე თქვენ დატკბებით ყველაზე საოცარი თოვლიანი პეიზაჟების ხედით თოვლში მოგზაურობისას ბაკურიანის გასწვრივ კავკასიის მთებში. გავივლით უნიკალურ ფიჭვნარს უძველესი სოფლების ნანგრევებს შორის. ბერძნებით დასახლებულ სოფელში მოგზაურობისას რეგიონის საუკეთესო ყავას დააგემოვნებთ. მოგზაურობის დასასრულს ჩვენ ვეწვევით კალმახის თევზის ფერმას, სადაც მოვამზადებთ თევზს იქვე გრილზე. იქიდან კომფორტული მიკროავტობუსი სასტარტო წერტილამდე მიგვიყვანს. ფასში შედის:თოვლში სასიარულო ეკიპირება (თოვლის ფეხსაცმელები, ჯოხები) საზვავე უსაფრთხოება, (საჭიროების შემთხვევაში) გიდის მომსახურება,თქვენზე მორგებული მარშრუტის დიზაინიუალკოჰოლო სასმელი და წასახემსებელი. დეტალური ინფორმაციისთის დაგვიკავშირდით ნომერზე:55555555."}]

docs=[{"name":"მიხეილ ყაველაშვილმა 28 კანონპროექტს მოაწერა ხელი",
       "text": "საარჩევნო კოლეგიის მიერ პრეზიდენტის თანამდებობაზე არჩეული მიხეილ ყაველაშვილის ხელმოწერით  მაცნეზე 28 კანონპროექტი გამოქვეყნდა.გამოქვეყნებულ კანონპროექტებს შორის არის შეკრებისა და მანიფესტაციების შეხახებ კანონში განხორციელებული ცვლილებები, რომლის საფუძველზეც დემონსტანტებს აქციების დროს ნიღბით და ნებისმიერი სხვა საშუალებით სახის დაფარვა, ასევე ლაზერული მოწყობილობებისა და პიროტექნიკის გამოყენება ეკრძალება. ყაველაშვილის ხელმოწერით ასევე ამოქმედდა კანონპროექტები, რომლის გათვალისწინებით, გაზრდილია ადმინისტრაციული ჯარიმები, ხოლო საჯარო სამსახურებში რეორგანიზაციის პროცესი მარტივდება.კერძოდ, დღეიდან ამოქმედდა: ⭕️საქართველოს კანონი საჯარო სამსახურის შესახებ;     ⭕️ კანონი შეკრებებისა და მანიფესტაციების შესახებ;     ⭕️ პოლიციის შესახებ კანონი;⭕️ ადმინისტრაციულ სამართალდარღვევათა კოდექსი მნიშვნელოვნად იზრდება სანქციები ისეთი სამართალდარღვევებისთვის, რომლებსაც შინაგან საქმეთა სამინისტრო, როგორც წესი, საპროტესტო აქციების მონაწილეთა წინააღმდეგ იყენებს.სახის დაფარვა ნიღბით ან ნებისმიერი სხვა საშუალებით იქნება ადმინისტრაციული სამართალდარღვევა, რომელიც გამოიწვევს დაჯარიმებას 2000 ლარით.აქციის მონაწილეებს ასევე აეკრძალებათ, თან იქონიონ „ლაზერული ან/და მკვეთრი გამოსხივების მქონე ისეთი საშუალება, რომლის გამოყენებამაც, შესაძლოა, ხელი შეუშალოს სახელმწიფო უწყებების წარმომადგენელთა საქმიანობას. სანქცია ასევე 2000 ლარი იქნება.და ა.შ."}]


infos=[{"name": "სვეტიცხოველი",
        "text":"სვეტიცხოვლის საკათედრო ტაძარი — საქართველოს მართლმადიდებელი ეკლესიის მთავარი საპატრიარქო საკათედრო ტაძარი, საქართველოს დედა-ტაძარი, საქართველოს კათოლიკოს-პატრიარქთა ინთრონიზაციის (აღსაყდრების) ადგილი, შუა საუკუნეების საქართველოს მრავალი მეფის, მათი ოჯახის წევრების და პატრიარქთა საკრძალავი, XI საუკუნის ქართული ხუროთმოძღვრების ძეგლი, ერთ-ერთი ოთხ დიდ კათედრალთაგან (ოშკი, ბაგრატის ტაძარი, ალავერდი). მდებარეობს თბილისიდან 20 კმ დაშორებით, ქალაქ მცხეთაში. სვეტიცხოველში დაკრძალულია უფლის კვართი და წმ. ელია წინასწარმეტყველის მოსასხამი. იუნესკოს მსოფლიო კულტურული მემკვიდრეობის ძეგლი.ისტორია სვეტიცხოველი ყველაზე დიდი ისტორიული საეკლესიო ნაგებობაა საქართველოში დღემდე გადარჩენილთა შორის. იგი საუკუნეთა მანძილზე ქრისტიანული საქართველოს სარწმუნოებრივ ცენტრს წარმოადგენდა. ჯერ კიდევ IV საუკუნეში გაქრისტიანებულ მირიან მეფეს წმინდა ნინოს რჩევით აქ პირველი ეკლესია აუშენებია, რომელსაც ჩვენამდე არ მოუღწევია.1970-1971 წლებში სარემონტო-სარესტავრაციო სამუშაოთა ჩატარების დროს მიკვლეულ იქნა მისი საძირკვლის კვალი. ასევე მთლიანად შემოიხაზა იმ ბაზილიკის გეგმა, რომელიც აქვე ააშენა, წმ. ნინოს ეკლესიის დანგრევის შემდეგ, ვახტანგ გორგასალმა V საუკუნის II ნახევარში. XI საუკუნეში დაზიანებული ბაზილიკის ადგილზე ქართლის კათოლიკოსმა მელქისედეკმა ახალი ტაძარი ააგო. მან ხუროთმოძღვრად არსუკისძე მიიწვია. მშენებლობა 1010 წელს დაიწყო და 1029 წელს დამთავრდა. თავისი არსებობის მანძილზე სვეტიცხოველი არაერთხელ გადაკეთებულა. 1283 წელს ტაძარი მიწისძვრამ დააზიანა. XIV საუკუნეში გიორგი ბრწყინვალემ აღადგინა ტაძრის გუმბათი. იმავე საუკუნის ბოლოს „იავარჰყვეს სპათა ლანგ-თემურისათა“ — მოანგრიეს დასავლეთის მკლავის ბურჯები, დააქციეს გუმბათის ყელი, მაგრამ მთელი ნაგებობის დანგრევა მაინც ვერ შესძლეს. XV საუკუნის დასაწყისში მეფე ალექსანდრე დიდმა ტაძარი კაპიტალურად შეაკეთებინა. 1656 წელს როსტომ მეფისა და მარიამ დედოფლის თაოსნობით კვლავ აღადგინეს გუბათის ყელი."}]
products = [
    {"name": "ძველი თბილისი",
     "text": "ძველი თბილისი — თბილისის ისტორიული ნაწილი, დაახლოებით მოიცავს იმ უბნებსა და დასახლებებს, რასაც 1936 წლამდე „ტფილისი“ ეწოდებოდა.",
     "img": "/static/თბილისი.jpg",
     "link": "#"},
    {"name": "სვეტიცხოველი",
     "text": "სვეტიცხოვლის საკათედრო ტაძარი — საქართველოს მართლმადიდებელი ეკლესიის მთავარი საპატრიარქო საკათედრო ტაძარია",
     "img": "/static/სვეტიცხოველი.jpg",
     "link": "/სვეტმეტი"},
    {"name": "უფლისციხე",
     "text": " უფლისციხე — კლდეში ნაკვეთი ქალაქი, კავკასიის ერთ-ერთი უძველესი დასახლება და საქალაქო ცენტრი. მდებარეობს ქ. გორის აღმოსავლეთით.",
     "img": "https://cdn.georgiantravelguide.com/storage/thumbnails/dji-0254-3.jpg",
     "link": "#"},
    {"name": "ჯვარი",
     "text": "მცხეთის ჯვრის მონასტერი - VI საუკუნის ტაძარი და მონასტერი. შეტანილია მსოფლიო კულტურული მემკვიდრეობის ძეგლთა სიაში.",
     "img": "/static/ჯვარი.jpg",
     "link": "#"},
    {"name": "გომის მთა",
     "text": "გომისმთა — დაბა და მაღალმთიანი კლიმატური საზაფხულო კურორტი საქართველოში, გურიის მხარის ოზურგეთის მუნიციპალიტეტში.",
     "img": "/static/გომი.jpg",
     "link": "#"},
    {"name": "ვარძია",
     "text": "ვარძია — კლდეში ნაკვეთი სამონასტრო ანსამბლი, XII-XIII საუკუნეების ქართული მხატვრული კულტურის ძეგლი. მდებარეობს ისტორიულ ჯავახეთში.",
     "img": "/static/ვარძია.jpg",
     "link": "#"}
]

users = [{"username": "AnaTodria", "password": "12345678", "role": "Admin"}, ]

things = [{
    "text": "მიხეილ ყაველაშვილმა 28 კანონპროექტს მოაწერა ხელი",
    "img": "https://cdn.ambebi.ge/media/__thumbs__/images/2024/12-30/kavelashvili-36095.webp",
    "link":"/meti"},
    {"text": "25 ცვლილება, რომელიც საქართველოში 2025 წლიდან ამოქმედდება",
     "img": "https://cdn.ambebi.ge/media/__thumbs__/images/2024/12-31/meliaqardava_4-45468.webp",
    "link":"#"},
    {
        "text": "ის მსოფლიოს ადამიანია...არამხოლოდ საფეხბურთო გამოცდილება მიიღო, არამედ ცხოვრებისეულიც... - გაზაევი ყაველაშვილს წერილს უძღვნის",
        "img": "https://cdn.ambebi.ge/media/__thumbs__/images/2024/12-30/gazaev-53062.webp",
        "link":"#"}
]

news = [{
    "text": "საზოგადოება „საქართველოს რკინიგზა“ - გაზრდილი მგზავრთნაკადის გამო, 11 და 12 იანვარს რეისები ემატება",
    "img": "https://cdn2.ipn.ge/media/__thumbs__/uploads/2022/04-22/rkinigza.webp",
"link":"#"},
    {"text": "კვარაცხელია ტრავმირებულია - რა მოხდა ნაპოლი-ლაციოს მატჩზე",
     "img": "https://cdn2.ipn.ge/media/__thumbs__/uploads/2023/06-02/kvaracxelia.webp",
     "link":"#"},
    {
        "text": "რას ეძებდნენ google-ში ყველაზე ხშირად საქართველოდან 2024 წელს",
        "img": "https://www.bpn.ge/media/__thumbs__/cover/w762/uploads/2023/12-28/1300346-google-1484810898-1703760545.jpg",
    "link":"#"},
]

tours = [{
    "name": "ტური ბაკურიანი-ციხისჯვარი",
    "img": "https://cdn.georgiantravelguide.com/storage/thumbnails/img-1120-2.jpg",
     "link":"/ბაკურიანი"},
    {"name": "ველოტური თრუსოს ხეობაში",
     "img": "https://cdn.georgiantravelguide.com/storage/files/veloturi-trusos-kheobashi-2.jpg",
     "link":"#"},
    {
        "name": "ტური თუშეთში",
        "img": "https://cdn.georgiantravelguide.com/storage/thumbnails/2-copy-1.jpg",
    "link":"#"},
    {"name": "ტური ჯავახეთში",
     "img": "https://cdn.georgiantravelguide.com/storage/files/borjomi-samtskhe-javakheti.jpg",
     "link":"#"},
    {"name": "ტური ბათუმი-მირვეთი",
     "img": "https://lh5.googleusercontent.com/p/AF1QipNN4elm2OChCfHuv-bxnhindOt0kMtXL0DqbzAB=w675-h390-n-k-no",
     "link":"#"},
    {
        "name": "ტური რაჭაში",
        "img": "https://cdn.georgiantravelguide.com/storage/files/minda-tsikhe-mindatsikhe-racha-fortress-minda.jpg",
    "link":"#"},

    {"name": "ტური ყაზბეგში",
     "img": "https://encrypted-tbn2.gstatic.com/licensed-image?q=tbn:ANd9GcR5UJekiOihDJC1xcLQxVDwsBTUrmvZTdnJLX79WT9K6uBgstiQQftoz99doI5DKjOrA4XDEOcBMboBZOq95NBS0g0lbWd6emxgDWUS9Q",
     "link":"#"},
    {"name": "ტური ჯუთაში",
     "img": "http://127.0.0.1:5000/static/%E1%83%AF%E1%83%A3%E1%83%97%E1%83%901.jpg",
     "link":"#"},
    {
        "name": "ტური მყინვარწვერზე",
        "img": "http://127.0.0.1:5000/static/myinvarwveri1.jpg",
      "link":"#"}
]


with app.app_context():
    db.drop_all()
    db.create_all()

    for product in products:
        new_product = Product(name=product["name"], text=product["text"], img=product["img"], link=product["link"])
        db.session.add(new_product)
    db.session.commit()

    for user in users:
        new_user = User(
            username=user["username"],
            password=user["password"],
            role=user["role"]
        )
        db.session.add(new_user)
    db.session.commit()

    for thing in things:
        new_thing = Thing(text=thing["text"], img=thing["img"],link=thing["link"])
        db.session.add(new_thing)
    db.session.commit()

    for new in news:
        new_new = New(text=new["text"], img=new["img"],link=new["link"])
        db.session.add(new_new)
    db.session.commit()

    for tour in tours:
        new_tour = Tour(name=tour["name"], img=tour["img"],link=tour["link"])
        db.session.add(new_tour)
    db.session.commit()


    for info in infos:
        new_info = Info(name=info["name"], text=info["text"])
        db.session.add(new_info)
    db.session.commit()

    for doc in docs:
        new_doc = Doc(name=doc["name"], text=doc["text"])
        db.session.add(new_doc)
    db.session.commit()

    for bak in baks:
        new_bak = Bak(name=bak["name"], text=bak["text"])
        db.session.add(new_bak)
    db.session.commit()





